Repository: WPmercs/word-count-and-limit
Catalog: wpwcl-*.po
Languages: fr_fr

source: Word Count and Limit Options
fr_fr: Options de Word Count and Limit

source: Save Changes
fr_fr: Enregistrer les modifications

source: Set a limit?
fr_fr: Imposer une limite ?

source: Impacted users
fr_fr: Utilisateurs impactés

source: Impacted post types
fr_fr: Types de ressource impactés

source: Max characters allowed
fr_fr: Nombre de caractères autorisés

source: Warning
fr_fr: Avertissement

source: Output Format
fr_fr: Format d'affichage

source: Warning message
fr_fr: Message d'avertissement

source: Contributor message
fr_fr: Message pour contributeurs

source: Here you can set the options of WP Word Count and Limit plugin. If you set a limit, the author of the post will be warned if he exceeds the character count limit by changing the characters/words display color (<span style="color: darkorange">orange</span>: near the limit, <span style="color: red">red</span>: over the limit). If he tries to submit his post as it exceeds the character limit, he will be prompted a message while hovering the submission div and submission will be refused.
fr_fr: Ici vous pouvez définir les paramètres de l'extension WP Word Count and Limit. Si vous définissez une limite, l'auteur d'un billet sera averti s'il dépasse le nombre de caractères maximum en modifiant la couleur d'affichage des cacactères/mots (<span style="color: darkorange">orange</span> : proche de la limite, <span style="color: red">rouge</span> : au-dessus de la limite). S'il tente de soumettre son article et que le nombre de caractère maximum est dépassé, un message d'avertissement s'affichera lorsque la souris survolera la boîte de soumission et la validation sera refusée.

source: Yes
fr_fr: Oui

source: No
fr_fr: Non

source: Contributors
fr_fr: Contributeurs

source: Authors
fr_fr: Auteurs

source: Editors
fr_fr: Editeurs

source: Administrators
fr_fr: Administrateurs

source: The users that should be limited (multiple users role possible).
fr_fr: Les utilisateurs qui devront être limités (plusieurs rôles peuvent être sélectionnés).

source: The post types that should be limited.
fr_fr: Les types de ressource devant être limitées (post, page, ...).

source: The max count of characters the author of a post can write.
fr_fr: Le nombre maximal de cararactères qu'un auteur peut écrire.

source: The number of characters before the max value the warning is fired.
fr_fr: Le nombre de caractères avant la valeur max où l'avertissement sera donné.

source: You can define the output display using the following variables: <code>#input</code> (the number of characters), <code>#words</code> (the number of words). When limitaion is set, two additionnal variables are available: <code>#max</code> (the max characters allowed), <code>#left</code> (the remaining characters). The HTML tags are allowed
fr_fr: Vous pouvez définir le format d'affichage en utilisant les variables suivantes : <code>#input</code> (le nombre de carctères saisis), <code>#words</code> (le nombre de mots). Lorsqu'une limite a été définie, deux autres variables sont disponibles : <code>#max</code> (le nombre de caractères maximum autorisé), <code>#left</code> (le nombre de caractères restant). Les balises HTML sont autorisées.

source: Regular use:
fr_fr: Utilisation normale :

source: <code>&lt;b&gt;#input&lt;/b&gt; characters | &lt;b&gt;#words&lt;/b&gt; words</code> will display <q style="padding: 2px 4px; border: #e0e0e0 1px solid; background: #f7f7f7;"><b>123</b> characters | <b>36</b> words.</q>.
fr_fr: <code>&lt;b&gt;#input&lt;/b&gt; caractères | &lt;b&gt;#words&lt;/b&gt; mots</code> affichera <q style="padding: 2px 4px; border: #e0e0e0 1px solid; background: #f7f7f7;"><b>123</b> caractères | <b>36</b> mots.</q>.

source: When limit set:
fr_fr: Quand une limite a été définie :

source: <code>#input/#max &lt;i&gt;characters&lt;/i&gt;, #left &lt;i&gt;left&lt;/i&gt; | #words &lt;i&gt;words&lt;/i&gt;</code> will display <q style="padding: 2px 4px; border: #e0e0e0 1px solid; background: #f7f7f7;">123/250 <i>characters</i>, 127 <i>left</i> | 36 <i>words</i></q> or <q style="padding: 2px 4px; border: #e0e0e0 1px solid; background: #f7f7f7; color: red;">256/250 <i>characters</i>, 0 <i>left</i> | 68 <i>words</i></q>.
fr_fr: <code>#input/#max &lt;i&gt;caractères&lt;/i&gt;, #left &lt;i&gt;restant&lt;/i&gt; | #words &lt;i&gt;mots&lt;/i&gt;</code> affichera <q style="padding: 2px 4px; border: #e0e0e0 1px solid; background: #f7f7f7; ">123/250 <i>caractères</i>, 127 <i>restant</i> | 36 <i>mots</i></q> ou <q style="padding: 2px 4px; border: #e0e0e0 1px solid; background: #f7f7f7; color: red;">256/250 <i>caractères</i>, 0 <i>restant</i> | 68 <i>mots</i></q>.

source: Sorry, but you exceeded the characters limit!
fr_fr: Désolé, mais vous avez dépassé le nombre maximal de caractères autorisés !

source: The message that will display when user exceeded the allowed characters count (no HTML tags allowed).
fr_fr: Le message qui s'affichera lorsque l'utilisateur dépasse le nombre de caractères autorisés (les balises HTML ne sont pas acceptées)

source: Your Post has been submitted to the editorial team for validation and publish. Thanks for your contribution!
fr_fr: Votre article va être soumis à notre équipe éditoriale pour validation et publication. Merci pour votre contribution !

source: The message that will display when a contributor submit a post (no HTML tags allowed).
fr_fr: Le message qui s'affichera lorsqu'un contributeur soumettra un article (pas de balises HTML autorisées)
